Request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cal="http://medium.com/types/calculator">
    <soapenv:Header/>
    <soapenv:Body>
        <cal:SubtractionInput>
            <cal:number1>44</cal:number1>
            <cal:number2>4</cal:number2>
        </cal:SubtractionInput>
    </soapenv:Body>
</soapenv:Envelope>